<?xml version="1.0" ?>
<net name="deepmedic-4-ov.model.ckpt" version="10">
	<layers>
		<layer id="0" name="net/inp_x_sub_0_test" type="Parameter" version="opset1">
			<data element_type="f16" shape="10, 1, 26, 26, 26"/>
			<output>
				<port id="0" names="net/inp_x_sub_0_test:0" precision="FP16">
					<dim>10</dim>
					<dim>1</dim>
					<dim>26</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="net/inp_x_test" type="Parameter" version="opset1">
			<data element_type="f16" shape="10, 1, 45, 45, 45"/>
			<output>
				<port id="0" names="net/inp_x_test:0" precision="FP16">
					<dim>10</dim>
					<dim>1</dim>
					<dim>45</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="net/Maximum_50/x" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1, 1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="net/Maximum_50/x:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="net/Maximum_47/x" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1, 1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="net/Maximum_47/x:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="net/Maximum_44/x" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1, 1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="net/Maximum_44/x:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="net/Maximum_20/x" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1, 1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="net/Maximum_20/x:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="net/Maximum_17/x" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1, 1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="net/Maximum_17/x:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="net/Maximum_14/x" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1, 1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="net/Maximum_14/x:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="net/Maximum_11/x" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1, 1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="net/Maximum_11/x:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="net/Maximum_8/x" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1, 1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="net/Maximum_8/x:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="net/Maximum_5/x" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1, 1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="net/Maximum_5/x:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="net/Maximum_2/x" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1, 1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="net/Maximum_2/x:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="net/Reshape" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="1, 1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="net/Reshape:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="net/add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>1</dim>
					<dim>45</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/add_2:0" precision="FP16">
					<dim>10</dim>
					<dim>1</dim>
					<dim>45</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="net/transpose_5/perm" type="Const" version="opset1">
			<data element_type="i64" offset="4" shape="5" size="40"/>
			<output>
				<port id="0" names="net/transpose_5/perm:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="net/transpose_5" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>1</dim>
					<dim>45</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/transpose_5:0" precision="FP16">
					<dim>10</dim>
					<dim>1</dim>
					<dim>45</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="net/transpose" type="Const" version="opset1">
			<data element_type="f16" offset="44" shape="30, 1, 3, 3, 3" size="1620"/>
			<output>
				<port id="0" names="net/transpose:0" precision="FP16">
					<dim>30</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="net/Conv3D_2" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>1</dim>
					<dim>45</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>30</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>43</dim>
					<dim>43</dim>
					<dim>43</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="750034203" type="Const" version="opset1">
			<data element_type="i64" offset="4" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="net/Conv3D_2/output_transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>43</dim>
					<dim>43</dim>
					<dim>43</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/Conv3D_2:0,net/transpose_6:0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>43</dim>
					<dim>43</dim>
					<dim>43</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="data_mul_111811118534371" type="Const" version="opset1">
			<data element_type="f16" offset="1664" shape="1, 30, 1, 1, 1" size="60"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="net/truediv_2/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>43</dim>
					<dim>43</dim>
					<dim>43</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>43</dim>
					<dim>43</dim>
					<dim>43</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="data_add_111821118734197" type="Const" version="opset1">
			<data element_type="f16" offset="1724" shape="1, 30, 1, 1, 1" size="60"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="net/sub_2/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>43</dim>
					<dim>43</dim>
					<dim>43</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/add_7:0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>43</dim>
					<dim>43</dim>
					<dim>43</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="net/Maximum_2" type="Maximum" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>43</dim>
					<dim>43</dim>
					<dim>43</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/Maximum_2:0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>43</dim>
					<dim>43</dim>
					<dim>43</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="net/Abs_2" type="Abs" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>43</dim>
					<dim>43</dim>
					<dim>43</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>43</dim>
					<dim>43</dim>
					<dim>43</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="net/sub_5/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>43</dim>
					<dim>43</dim>
					<dim>43</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>43</dim>
					<dim>43</dim>
					<dim>43</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/sub_5:0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>43</dim>
					<dim>43</dim>
					<dim>43</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="data_mul_111891119134689" type="Const" version="opset1">
			<data element_type="f16" offset="1784" shape="1, 30, 1, 1, 1" size="60"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="net/mul_7/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>43</dim>
					<dim>43</dim>
					<dim>43</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/mul_8:0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>43</dim>
					<dim>43</dim>
					<dim>43</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="net/add_12" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>43</dim>
					<dim>43</dim>
					<dim>43</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>43</dim>
					<dim>43</dim>
					<dim>43</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/add_12:0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>43</dim>
					<dim>43</dim>
					<dim>43</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="net/transpose_12/perm" type="Const" version="opset1">
			<data element_type="i64" offset="4" shape="5" size="40"/>
			<output>
				<port id="0" names="net/transpose_12/perm:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="net/transpose_12" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>43</dim>
					<dim>43</dim>
					<dim>43</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/transpose_12:0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>43</dim>
					<dim>43</dim>
					<dim>43</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="net/transpose_7" type="Const" version="opset1">
			<data element_type="f16" offset="1844" shape="30, 30, 3, 3, 3" size="48600"/>
			<output>
				<port id="0" names="net/transpose_7:0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="net/Conv3D_5" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>43</dim>
					<dim>43</dim>
					<dim>43</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>41</dim>
					<dim>41</dim>
					<dim>41</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="750834593" type="Const" version="opset1">
			<data element_type="i64" offset="4" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="net/Conv3D_5/output_transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>41</dim>
					<dim>41</dim>
					<dim>41</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/Conv3D_5:0,net/transpose_13:0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>41</dim>
					<dim>41</dim>
					<dim>41</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="data_mul_111931119734131" type="Const" version="opset1">
			<data element_type="f16" offset="50444" shape="1, 30, 1, 1, 1" size="60"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="net/truediv_5/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>41</dim>
					<dim>41</dim>
					<dim>41</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>41</dim>
					<dim>41</dim>
					<dim>41</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="data_add_111941119934059" type="Const" version="opset1">
			<data element_type="f16" offset="50504" shape="1, 30, 1, 1, 1" size="60"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="net/sub_8/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>41</dim>
					<dim>41</dim>
					<dim>41</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/add_17:0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>41</dim>
					<dim>41</dim>
					<dim>41</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="net/Maximum_5" type="Maximum" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>41</dim>
					<dim>41</dim>
					<dim>41</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/Maximum_5:0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>41</dim>
					<dim>41</dim>
					<dim>41</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="net/Abs_5" type="Abs" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>41</dim>
					<dim>41</dim>
					<dim>41</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>41</dim>
					<dim>41</dim>
					<dim>41</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="net/sub_11/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>41</dim>
					<dim>41</dim>
					<dim>41</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>41</dim>
					<dim>41</dim>
					<dim>41</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/sub_11:0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>41</dim>
					<dim>41</dim>
					<dim>41</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="data_mul_112011120334176" type="Const" version="opset1">
			<data element_type="f16" offset="50564" shape="1, 30, 1, 1, 1" size="60"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="net/mul_16/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>41</dim>
					<dim>41</dim>
					<dim>41</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/mul_17:0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>41</dim>
					<dim>41</dim>
					<dim>41</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="net/add_22" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>41</dim>
					<dim>41</dim>
					<dim>41</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>41</dim>
					<dim>41</dim>
					<dim>41</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/add_22:0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>41</dim>
					<dim>41</dim>
					<dim>41</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="net/transpose_19/perm" type="Const" version="opset1">
			<data element_type="i64" offset="4" shape="5" size="40"/>
			<output>
				<port id="0" names="net/transpose_19/perm:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="net/transpose_19" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>41</dim>
					<dim>41</dim>
					<dim>41</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/transpose_19:0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>41</dim>
					<dim>41</dim>
					<dim>41</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="net/transpose_14" type="Const" version="opset1">
			<data element_type="f16" offset="50624" shape="40, 30, 3, 3, 3" size="64800"/>
			<output>
				<port id="0" names="net/transpose_14:0" precision="FP16">
					<dim>40</dim>
					<dim>30</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="net/Conv3D_8" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>41</dim>
					<dim>41</dim>
					<dim>41</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>40</dim>
					<dim>30</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>39</dim>
					<dim>39</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="751634515" type="Const" version="opset1">
			<data element_type="i64" offset="4" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="net/Conv3D_8/output_transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>39</dim>
					<dim>39</dim>
					<dim>39</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/Conv3D_8:0,net/transpose_20:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>39</dim>
					<dim>39</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="data_mul_112051120934104" type="Const" version="opset1">
			<data element_type="f16" offset="115424" shape="1, 40, 1, 1, 1" size="80"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="net/truediv_8/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>39</dim>
					<dim>39</dim>
					<dim>39</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>39</dim>
					<dim>39</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="data_add_112061121134476" type="Const" version="opset1">
			<data element_type="f16" offset="115504" shape="1, 40, 1, 1, 1" size="80"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="net/sub_14/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>39</dim>
					<dim>39</dim>
					<dim>39</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/add_27:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>39</dim>
					<dim>39</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="net/Maximum_8" type="Maximum" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>39</dim>
					<dim>39</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/Maximum_8:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>39</dim>
					<dim>39</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="net/Abs_8" type="Abs" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>39</dim>
					<dim>39</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>39</dim>
					<dim>39</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="net/sub_17/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>39</dim>
					<dim>39</dim>
					<dim>39</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>39</dim>
					<dim>39</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/sub_17:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>39</dim>
					<dim>39</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="data_mul_112131121534314" type="Const" version="opset1">
			<data element_type="f16" offset="115584" shape="1, 40, 1, 1, 1" size="80"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="net/mul_25/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>39</dim>
					<dim>39</dim>
					<dim>39</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/mul_26:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>39</dim>
					<dim>39</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="net/add_32" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>39</dim>
					<dim>39</dim>
					<dim>39</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>39</dim>
					<dim>39</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/add_32:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>39</dim>
					<dim>39</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="net/transpose_26/perm" type="Const" version="opset1">
			<data element_type="i64" offset="4" shape="5" size="40"/>
			<output>
				<port id="0" names="net/transpose_26/perm:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="net/transpose_26" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>39</dim>
					<dim>39</dim>
					<dim>39</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/transpose_26:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>39</dim>
					<dim>39</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="net/transpose_21" type="Const" version="opset1">
			<data element_type="f16" offset="115664" shape="40, 40, 3, 3, 3" size="86400"/>
			<output>
				<port id="0" names="net/transpose_21:0" precision="FP16">
					<dim>40</dim>
					<dim>40</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="net/Conv3D_11" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>39</dim>
					<dim>39</dim>
					<dim>39</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>40</dim>
					<dim>40</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="752434332" type="Const" version="opset1">
			<data element_type="i64" offset="4" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="net/Conv3D_11/output_transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/Conv3D_11:0,net/transpose_27:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="data_mul_112171122134236" type="Const" version="opset1">
			<data element_type="f16" offset="202064" shape="1, 40, 1, 1, 1" size="80"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="net/truediv_11/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="data_add_112181122334368" type="Const" version="opset1">
			<data element_type="f16" offset="202144" shape="1, 40, 1, 1, 1" size="80"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="net/sub_20/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/add_37:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="net/Maximum_11" type="Maximum" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/Maximum_11:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="net/Abs_11" type="Abs" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="net/sub_23/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/sub_23:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="data_mul_112251122734044" type="Const" version="opset1">
			<data element_type="f16" offset="202224" shape="1, 40, 1, 1, 1" size="80"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="net/mul_34/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/mul_35:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="net/add_42" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/add_42:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="net/transpose_33/perm" type="Const" version="opset1">
			<data element_type="i64" offset="4" shape="5" size="40"/>
			<output>
				<port id="0" names="net/transpose_33/perm:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="net/transpose_33" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/transpose_33:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="net/transpose_28" type="Const" version="opset1">
			<data element_type="f16" offset="202304" shape="40, 40, 3, 3, 3" size="86400"/>
			<output>
				<port id="0" names="net/transpose_28:0" precision="FP16">
					<dim>40</dim>
					<dim>40</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="net/Conv3D_14" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>40</dim>
					<dim>40</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>35</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="753233963" type="Const" version="opset1">
			<data element_type="i64" offset="4" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="net/Conv3D_14/output_transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>35</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/Conv3D_14:0,net/transpose_34:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>35</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="data_mul_112291123334029" type="Const" version="opset1">
			<data element_type="f16" offset="288704" shape="1, 40, 1, 1, 1" size="80"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="net/truediv_14/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>35</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>35</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="data_add_112301123534278" type="Const" version="opset1">
			<data element_type="f16" offset="288784" shape="1, 40, 1, 1, 1" size="80"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="net/sub_26/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>35</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/add_47:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>35</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="net/Maximum_14" type="Maximum" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>35</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/Maximum_14:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>35</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="net/Abs_14" type="Abs" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>35</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>35</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="net/sub_29/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>35</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>35</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/sub_29:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>35</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="data_mul_112371123933987" type="Const" version="opset1">
			<data element_type="f16" offset="288864" shape="1, 40, 1, 1, 1" size="80"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="net/mul_43/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>35</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/mul_44:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>35</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="net/add_52" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>35</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>35</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/add_52:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>35</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="net/transpose_40/perm" type="Const" version="opset1">
			<data element_type="i64" offset="4" shape="5" size="40"/>
			<output>
				<port id="0" names="net/transpose_40/perm:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="net/transpose_40" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>35</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/transpose_40:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>35</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="net/transpose_35" type="Const" version="opset1">
			<data element_type="f16" offset="288944" shape="40, 40, 3, 3, 3" size="86400"/>
			<output>
				<port id="0" names="net/transpose_35:0" precision="FP16">
					<dim>40</dim>
					<dim>40</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="net/Conv3D_17" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>35</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>40</dim>
					<dim>40</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>33</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="754034263" type="Const" version="opset1">
			<data element_type="i64" offset="4" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="net/Conv3D_17/output_transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>33</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/Conv3D_17:0,net/transpose_41:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>33</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="data_mul_112411124534566" type="Const" version="opset1">
			<data element_type="f16" offset="375344" shape="1, 40, 1, 1, 1" size="80"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="net/truediv_17/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>33</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>33</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="data_add_112421124734482" type="Const" version="opset1">
			<data element_type="f16" offset="375424" shape="1, 40, 1, 1, 1" size="80"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="net/sub_32/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>33</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/add_57:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>33</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="net/Maximum_17" type="Maximum" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>33</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/Maximum_17:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>33</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="net/Abs_17" type="Abs" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>33</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>33</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="net/sub_35/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>33</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>33</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="2" names="net/sub_35:0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>33</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="data_mul_112491125134461" type="Const" version="opset1">
			<data element_type="f16" offset="375504" shape="1, 40, 1, 1, 1" size="80"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="net/mul_52/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>40</dim>
					<dim>33</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
