<?xml version="1.0" ?>
<net name="deepmedic-4-ov.model.ckpt" version="10">
	<layers>
		<layer id="0" name="2525252912808" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1,1,1,1,1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="2526253012853" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="1,1,1,1,1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="2527253113396" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1,1,1,1,1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="2528253213435" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="1,1,1,1,1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="data_add_112121121434177103712664" type="Const" version="opset1">
			<data element_type="f32" offset="8" shape="1,2,1,1,1" size="8"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="net/add_180/Fused_Add_/fq_input_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="758234330103513171" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="4748475212814" type="Const" version="opset1">
			<data element_type="f32" offset="56" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="8" name="4749475311131" type="Const" version="opset1">
			<data element_type="f32" offset="60" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="9" name="4750475413312" type="Const" version="opset1">
			<data element_type="f32" offset="56" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="10" name="4751475512736" type="Const" version="opset1">
			<data element_type="f32" offset="60" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="11" name="1368137011506" type="Const" version="opset1">
			<data element_type="f32" offset="64" shape="1,2,1,1,1" size="8"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="3155315912472" type="Const" version="opset1">
			<data element_type="f32" offset="72" shape="2,1,1,1,1" size="8"/>
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="3156316010723" type="Const" version="opset1">
			<data element_type="f32" offset="80" shape="2,1,1,1,1" size="8"/>
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="3157316112454" type="Const" version="opset1">
			<data element_type="f32" offset="72" shape="2,1,1,1,1" size="8"/>
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="3158316212328" type="Const" version="opset1">
			<data element_type="f32" offset="80" shape="2,1,1,1,1" size="8"/>
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="net/transpose_126103311008" type="Const" version="opset1">
			<data element_type="f32" offset="88" shape="2,150,1,1,1" size="1200"/>
			<output>
				<port id="0" names="net/transpose_126:0" precision="FP32">
					<dim>2</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="net/Conv3D_56/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>2</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="net/transpose_131/perm103111230" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" names="net/transpose_131/perm:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="4638464211902" type="Const" version="opset1">
			<data element_type="f32" offset="1288" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="20" name="4639464313297" type="Const" version="opset1">
			<data element_type="f32" offset="1292" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="21" name="4640464413342" type="Const" version="opset1">
			<data element_type="f32" offset="1288" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="22" name="4641464510774" type="Const" version="opset1">
			<data element_type="f32" offset="1292" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="23" name="2445244913345" type="Const" version="opset1">
			<data element_type="f32" offset="1296" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="24" name="2446245012166" type="Const" version="opset1">
			<data element_type="f32" offset="1300" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="25" name="2447245112832" type="Const" version="opset1">
			<data element_type="f32" offset="1296" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="26" name="2448245210813" type="Const" version="opset1">
			<data element_type="f32" offset="1300" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="27" name="2025202911572" type="Const" version="opset1">
			<data element_type="f32" offset="1304" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="28" name="2026203012247" type="Const" version="opset1">
			<data element_type="f32" offset="1308" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="29" name="2027203113189" type="Const" version="opset1">
			<data element_type="f32" offset="1304" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="30" name="2028203212859" type="Const" version="opset1">
			<data element_type="f32" offset="1308" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="31" name="3525352912835" type="Const" version="opset1">
			<data element_type="f32" offset="1312" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="32" name="3526353012073" type="Const" version="opset1">
			<data element_type="f32" offset="1316" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="33" name="3527353110846" type="Const" version="opset1">
			<data element_type="f32" offset="1312" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="34" name="3528353212844" type="Const" version="opset1">
			<data element_type="f32" offset="1316" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="35" name="2115211912646" type="Const" version="opset1">
			<data element_type="f32" offset="1320" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="36" name="2116212011566" type="Const" version="opset1">
			<data element_type="f32" offset="1324" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="37" name="2117212112133" type="Const" version="opset1">
			<data element_type="f32" offset="1320" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="38" name="2118212211212" type="Const" version="opset1">
			<data element_type="f32" offset="1324" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="39" name="data_mul_112001120434057101910822" type="Const" version="opset1">
			<data element_type="f32" offset="1328" shape="1,150,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="757434006101712724" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="5118512211941" type="Const" version="opset1">
			<data element_type="f32" offset="1928" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="42" name="5119512311956" type="Const" version="opset1">
			<data element_type="f32" offset="1932" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="43" name="5120512412601" type="Const" version="opset1">
			<data element_type="f32" offset="1928" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="44" name="5121512511548" type="Const" version="opset1">
			<data element_type="f32" offset="1932" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="45" name="1364136612046" type="Const" version="opset1">
			<data element_type="f32" offset="1936" shape="1,150,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="2605260911944" type="Const" version="opset1">
			<data element_type="f32" offset="2536" shape="150,1,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="2606261011932" type="Const" version="opset1">
			<data element_type="f32" offset="3136" shape="150,1,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="2607261111038" type="Const" version="opset1">
			<data element_type="f32" offset="2536" shape="150,1,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="2608261212085" type="Const" version="opset1">
			<data element_type="f32" offset="3136" shape="150,1,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="net/transpose_119101513135" type="Const" version="opset1">
			<data element_type="f32" offset="3736" shape="150,150,1,1,1" size="90000"/>
			<output>
				<port id="0" names="net/transpose_119:0" precision="FP32">
					<dim>150</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="net/Conv3D_53/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>150</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>150</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="net/transpose_124/perm101312061" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" names="net/transpose_124/perm:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="4628463212451" type="Const" version="opset1">
			<data element_type="f32" offset="93736" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="54" name="4629463312880" type="Const" version="opset1">
			<data element_type="f32" offset="93740" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="55" name="4630463413405" type="Const" version="opset1">
			<data element_type="f32" offset="93736" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="56" name="4631463512334" type="Const" version="opset1">
			<data element_type="f32" offset="93740" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="57" name="3165316912052" type="Const" version="opset1">
			<data element_type="f32" offset="93744" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="58" name="3166317012460" type="Const" version="opset1">
			<data element_type="f32" offset="93748" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="59" name="3167317112796" type="Const" version="opset1">
			<data element_type="f32" offset="93744" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="60" name="3168317211899" type="Const" version="opset1">
			<data element_type="f32" offset="93748" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="61" name="2475247912391" type="Const" version="opset1">
			<data element_type="f32" offset="93752" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="62" name="2476248013255" type="Const" version="opset1">
			<data element_type="f32" offset="93756" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="63" name="2477248110837" type="Const" version="opset1">
			<data element_type="f32" offset="93752" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="64" name="2478248211128" type="Const" version="opset1">
			<data element_type="f32" offset="93756" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="65" name="3415341911407" type="Const" version="opset1">
			<data element_type="f32" offset="93760" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="66" name="3416342012805" type="Const" version="opset1">
			<data element_type="f32" offset="93764" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="67" name="3417342113132" type="Const" version="opset1">
			<data element_type="f32" offset="93760" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="68" name="3418342212985" type="Const" version="opset1">
			<data element_type="f32" offset="93764" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="69" name="3035303911878" type="Const" version="opset1">
			<data element_type="f32" offset="93768" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="70" name="3036304012979" type="Const" version="opset1">
			<data element_type="f32" offset="93772" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="71" name="3037304111740" type="Const" version="opset1">
			<data element_type="f32" offset="93768" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="72" name="3038304213150" type="Const" version="opset1">
			<data element_type="f32" offset="93772" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="73" name="data_mul_111881119234273100113441" type="Const" version="opset1">
			<data element_type="f32" offset="93776" shape="1,150,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="75663395899913225" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="5098510211848" type="Const" version="opset1">
			<data element_type="f32" offset="94376" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="76" name="5099510312868" type="Const" version="opset1">
			<data element_type="f32" offset="94380" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="77" name="5100510411500" type="Const" version="opset1">
			<data element_type="f32" offset="94376" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="78" name="5101510511317" type="Const" version="opset1">
			<data element_type="f32" offset="94380" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="79" name="1360136211377" type="Const" version="opset1">
			<data element_type="f32" offset="1936" shape="1,150,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="2275227911578" type="Const" version="opset1">
			<data element_type="f32" offset="94384" shape="150,1,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="2276228012871" type="Const" version="opset1">
			<data element_type="f32" offset="94984" shape="150,1,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="2277228110714" type="Const" version="opset1">
			<data element_type="f32" offset="94384" shape="150,1,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="2278228210924" type="Const" version="opset1">
			<data element_type="f32" offset="94984" shape="150,1,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="net/transpose_11299712676" type="Const" version="opset1">
			<data element_type="f32" offset="95584" shape="150,100,1,1,1" size="60000"/>
			<output>
				<port id="0" names="net/transpose_112:0" precision="FP32">
					<dim>150</dim>
					<dim>100</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="net/Conv3D_50/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>150</dim>
					<dim>100</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>150</dim>
					<dim>100</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="net/transpose_117/perm99511251" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" names="net/transpose_117/perm:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="4618462211803" type="Const" version="opset1">
			<data element_type="f32" offset="155584" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="88" name="4619462311896" type="Const" version="opset1">
			<data element_type="f32" offset="155588" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="89" name="4620462411494" type="Const" version="opset1">
			<data element_type="f32" offset="155584" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="90" name="4621462511071" type="Const" version="opset1">
			<data element_type="f32" offset="155588" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="91" name="2235223912388" type="Const" version="opset1">
			<data element_type="f32" offset="155592" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="92" name="2236224012643" type="Const" version="opset1">
			<data element_type="f32" offset="155596" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="93" name="2237224112136" type="Const" version="opset1">
			<data element_type="f32" offset="155592" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="94" name="2238224212700" type="Const" version="opset1">
			<data element_type="f32" offset="155596" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="95" name="2155215911653" type="Const" version="opset1">
			<data element_type="f32" offset="155600" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="96" name="2156216011812" type="Const" version="opset1">
			<data element_type="f32" offset="155604" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="97" name="2157216111509" type="Const" version="opset1">
			<data element_type="f32" offset="155600" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="98" name="2158216210987" type="Const" version="opset1">
			<data element_type="f32" offset="155604" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="99" name="3085308912727" type="Const" version="opset1">
			<data element_type="f32" offset="155608" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="100" name="3086309012190" type="Const" version="opset1">
			<data element_type="f32" offset="155612" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="101" name="3087309112826" type="Const" version="opset1">
			<data element_type="f32" offset="155608" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="102" name="3088309213111" type="Const" version="opset1">
			<data element_type="f32" offset="155612" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="103" name="data_mul_11176111803400398513375" type="Const" version="opset1">
			<data element_type="f32" offset="155616" shape="1,100,1,1,1" size="400"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>100</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="net/strided_slice_111/stack98011017" type="Const" version="opset1">
			<data element_type="i64" offset="156016" shape="5" size="40"/>
			<output>
				<port id="0" names="net/strided_slice_111/stack:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="net/strided_slice_111/stack_198112721" type="Const" version="opset1">
			<data element_type="i64" offset="156056" shape="5" size="40"/>
			<output>
				<port id="0" names="net/strided_slice_111/stack_1:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="net/strided_slice_111/stack_298212178" type="Const" version="opset1">
			<data element_type="i64" offset="156096" shape="5" size="40"/>
			<output>
				<port id="0" names="net/strided_slice_111/stack_2:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="net/Tile_8/multiples94811305" type="Const" version="opset1">
			<data element_type="i64" offset="156136" shape="5" size="40"/>
			<output>
				<port id="0" names="net/Tile_8/multiples:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="net/Tile_7/multiples88212574" type="Const" version="opset1">
			<data element_type="i64" offset="156176" shape="5" size="40"/>
			<output>
				<port id="0" names="net/Tile_7/multiples:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="net/Tile_6/multiples81610699" type="Const" version="opset1">
			<data element_type="i64" offset="156216" shape="5" size="40"/>
			<output>
				<port id="0" names="net/Tile_6/multiples:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="75583400978012169" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="5078508212496" type="Const" version="opset1">
			<data element_type="f32" offset="156256" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="112" name="5079508311860" type="Const" version="opset1">
			<data element_type="f32" offset="156260" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="113" name="5080508412418" type="Const" version="opset1">
			<data element_type="f32" offset="156256" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="114" name="5081508511911" type="Const" version="opset1">
			<data element_type="f32" offset="156260" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="115" name="1356135811110" type="Const" version="opset1">
			<data element_type="f32" offset="156264" shape="1,50,1,1,1" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="3345334911638" type="Const" version="opset1">
			<data element_type="f32" offset="156464" shape="50,1,1,1,1" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="3346335010735" type="Const" version="opset1">
			<data element_type="f32" offset="156664" shape="50,1,1,1,1" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="3347335112367" type="Const" version="opset1">
			<data element_type="f32" offset="156464" shape="50,1,1,1,1" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="3348335212457" type="Const" version="opset1">
			<data element_type="f32" offset="156664" shape="50,1,1,1,1" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="net/transpose_10577811962" type="Const" version="opset1">
			<data element_type="f32" offset="156864" shape="50,50,3,3,3" size="270000"/>
			<output>
				<port id="0" names="net/transpose_105:0" precision="FP32">
					<dim>50</dim>
					<dim>50</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="net/Conv3D_47/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>50</dim>
					<dim>50</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>50</dim>
					<dim>50</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="net/transpose_110/perm77610969" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" names="net/transpose_110/perm:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="4598460213084" type="Const" version="opset1">
			<data element_type="f32" offset="426864" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="124" name="4599460311275" type="Const" version="opset1">
			<data element_type="f32" offset="426868" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="125" name="4600460411119" type="Const" version="opset1">
			<data element_type="f32" offset="426864" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="126" name="4601460512298" type="Const" version="opset1">
			<data element_type="f32" offset="426868" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="127" name="2365236913408" type="Const" version="opset1">
			<data element_type="f32" offset="426872" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="128" name="2366237012847" type="Const" version="opset1">
			<data element_type="f32" offset="426876" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="129" name="2367237112400" type="Const" version="opset1">
			<data element_type="f32" offset="426872" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="130" name="2368237213288" type="Const" version="opset1">
			<data element_type="f32" offset="426876" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="131" name="2075207912319" type="Const" version="opset1">
			<data element_type="f32" offset="426880" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="132" name="2076208011191" type="Const" version="opset1">
			<data element_type="f32" offset="426884" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="133" name="2077208111827" type="Const" version="opset1">
			<data element_type="f32" offset="426880" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="134" name="2078208210720" type="Const" version="opset1">
			<data element_type="f32" offset="426884" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="135" name="3195319911155" type="Const" version="opset1">
			<data element_type="f32" offset="426888" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="136" name="3196320011863" type="Const" version="opset1">
			<data element_type="f32" offset="426892" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="137" name="3197320111539" type="Const" version="opset1">
			<data element_type="f32" offset="426888" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="138" name="3198320211707" type="Const" version="opset1">
			<data element_type="f32" offset="426892" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="139" name="data_mul_11080110843372476611875" type="Const" version="opset1">
			<data element_type="f32" offset="426896" shape="1,50,1,1,1" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="75503369476411419" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="4948495213243" type="Const" version="opset1">
			<data element_type="f32" offset="427096" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="142" name="4949495311371" type="Const" version="opset1">
			<data element_type="f32" offset="427100" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="143" name="4950495412775" type="Const" version="opset1">
			<data element_type="f32" offset="427096" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="144" name="4951495511221" type="Const" version="opset1">
			<data element_type="f32" offset="427100" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="145" name="1352135412886" type="Const" version="opset1">
			<data element_type="f32" offset="156264" shape="1,50,1,1,1" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="146" name="2565256912637" type="Const" version="opset1">
			<data element_type="f32" offset="427104" shape="50,1,1,1,1" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="147" name="2566257012850" type="Const" version="opset1">
			<data element_type="f32" offset="427304" shape="50,1,1,1,1" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="148" name="2567257113105" type="Const" version="opset1">
			<data element_type="f32" offset="427104" shape="50,1,1,1,1" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="149" name="2568257210954" type="Const" version="opset1">
			<data element_type="f32" offset="427304" shape="50,1,1,1,1" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="150" name="net/transpose_9876212535" type="Const" version="opset1">
			<data element_type="f32" offset="427504" shape="50,40,3,3,3" size="216000"/>
			<output>
				<port id="0" names="net/transpose_98:0" precision="FP32">
					<dim>50</dim>
					<dim>40</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="151" name="net/Conv3D_44/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>50</dim>
					<dim>40</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>50</dim>
					<dim>40</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="152" name="net/transpose_103/perm76011203" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" names="net/transpose_103/perm:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="153" name="4588459213045" type="Const" version="opset1">
			<data element_type="f32" offset="643504" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="154" name="4589459311392" type="Const" version="opset1">
			<data element_type="f32" offset="643508" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="155" name="4590459410825" type="Const" version="opset1">
			<data element_type="f32" offset="643504" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="156" name="4591459513426" type="Const" version="opset1">
			<data element_type="f32" offset="643508" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="157" name="3325332913267" type="Const" version="opset1">
			<data element_type="f32" offset="643512" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="158" name="3326333013336" type="Const" version="opset1">
			<data element_type="f32" offset="643516" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="159" name="3327333111050" type="Const" version="opset1">
			<data element_type="f32" offset="643512" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="160" name="3328333212583" type="Const" version="opset1">
			<data element_type="f32" offset="643516" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="161" name="2955295911554" type="Const" version="opset1">
			<data element_type="f32" offset="643520" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="162" name="2956296011632" type="Const" version="opset1">
			<data element_type="f32" offset="643524" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="163" name="2957296113102" type="Const" version="opset1">
			<data element_type="f32" offset="643520" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="164" name="2958296210747" type="Const" version="opset1">
			<data element_type="f32" offset="643524" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="165" name="2135213912997" type="Const" version="opset1">
			<data element_type="f32" offset="643528" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="166" name="2136214011926" type="Const" version="opset1">
			<data element_type="f32" offset="643532" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="167" name="2137214110768" type="Const" version="opset1">
			<data element_type="f32" offset="643528" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="168" name="2138214213090" type="Const" version="opset1">
			<data element_type="f32" offset="643532" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="169" name="data_mul_11068110723408775013006" type="Const" version="opset1">
			<data element_type="f32" offset="643536" shape="1,40,1,1,1" size="160"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="170" name="75423423174811122" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="171" name="4938494213258" type="Const" version="opset1">
			<data element_type="f32" offset="643696" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="172" name="4939494313009" type="Const" version="opset1">
			<data element_type="f32" offset="643700" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="173" name="4940494412523" type="Const" version="opset1">
			<data element_type="f32" offset="643696" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="174" name="4941494511983" type="Const" version="opset1">
			<data element_type="f32" offset="643700" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="175" name="1348135012382" type="Const" version="opset1">
			<data element_type="f32" offset="643704" shape="1,40,1,1,1" size="160"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="176" name="3405340912493" type="Const" version="opset1">
			<data element_type="f32" offset="643864" shape="40,1,1,1,1" size="160"/>
			<output>
				<port id="0" precision="FP32">
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="177" name="3406341011179" type="Const" version="opset1">
			<data element_type="f32" offset="644024" shape="40,1,1,1,1" size="160"/>
			<output>
				<port id="0" precision="FP32">
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="178" name="3407341111590" type="Const" version="opset1">
			<data element_type="f32" offset="643864" shape="40,1,1,1,1" size="160"/>
			<output>
				<port id="0" precision="FP32">
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="179" name="3408341212688" type="Const" version="opset1">
			<data element_type="f32" offset="644024" shape="40,1,1,1,1" size="160"/>
			<output>
				<port id="0" precision="FP32">
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="180" name="net/transpose_9174611794" type="Const" version="opset1">
			<data element_type="f32" offset="644184" shape="40,40,3,3,3" size="172800"/>
			<output>
				<port id="0" names="net/transpose_91:0" precision="FP32">
					<dim>40</dim>
					<dim>40</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="181" name="net/Conv3D_41/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>40</dim>
					<dim>40</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>40</dim>
					<dim>40</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="182" name="net/transpose_96/perm74410963" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" names="net/transpose_96/perm:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="183" name="4578458213384" type="Const" version="opset1">
			<data element_type="f32" offset="816984" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="184" name="4579458313393" type="Const" version="opset1">
			<data element_type="f32" offset="816988" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="185" name="4580458411029" type="Const" version="opset1">
			<data element_type="f32" offset="816984" shape="" size="4"/>
			<output>
