<?xml version="1.0" ?>
<net name="deepmedic-4-ov.model.ckpt" version="10">
	<layers>
		<layer id="0" name="2876288013471" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1,1,1,1,1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="2877288111125" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="1,1,1,1,1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="2878288211287" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1,1,1,1,1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="2879288310882" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="1,1,1,1,1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="data_add_113011130334017104912337" type="Const" version="opset1">
			<data element_type="f32" offset="8" shape="1,2,1,1,1" size="8"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="net/add_180/Fused_Add_/fq_input_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="764433978104713282" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="4772477611299" type="Const" version="opset1">
			<data element_type="f32" offset="56" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="8" name="4773477713048" type="Const" version="opset1">
			<data element_type="f32" offset="60" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="9" name="4774477813258" type="Const" version="opset1">
			<data element_type="f32" offset="56" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="10" name="4775477913345" type="Const" version="opset1">
			<data element_type="f32" offset="60" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="11" name="1383138512451" type="Const" version="opset1">
			<data element_type="f32" offset="64" shape="1,2,1,1,1" size="8"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="2726273011635" type="Const" version="opset1">
			<data element_type="f32" offset="72" shape="2,1,1,1,1" size="8"/>
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="2727273111341" type="Const" version="opset1">
			<data element_type="f32" offset="80" shape="2,1,1,1,1" size="8"/>
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="2728273211389" type="Const" version="opset1">
			<data element_type="f32" offset="72" shape="2,1,1,1,1" size="8"/>
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="2729273311593" type="Const" version="opset1">
			<data element_type="f32" offset="80" shape="2,1,1,1,1" size="8"/>
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="net/transpose_126104512916" type="Const" version="opset1">
			<data element_type="f32" offset="88" shape="2,150,1,1,1" size="1200"/>
			<output>
				<port id="0" names="net/transpose_126:0" precision="FP32">
					<dim>2</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="net/Conv3D_56/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>2</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="net/transpose_131/perm104311215" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" names="net/transpose_131/perm:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="4662466611887" type="Const" version="opset1">
			<data element_type="f32" offset="1288" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="20" name="4663466711311" type="Const" version="opset1">
			<data element_type="f32" offset="1292" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="21" name="4664466813543" type="Const" version="opset1">
			<data element_type="f32" offset="1288" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="22" name="4665466912769" type="Const" version="opset1">
			<data element_type="f32" offset="1292" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="23" name="2886289012541" type="Const" version="opset1">
			<data element_type="f32" offset="1296" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="24" name="2887289111716" type="Const" version="opset1">
			<data element_type="f32" offset="1300" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="25" name="2888289211641" type="Const" version="opset1">
			<data element_type="f32" offset="1296" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="26" name="2889289312973" type="Const" version="opset1">
			<data element_type="f32" offset="1300" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="27" name="3386339011275" type="Const" version="opset1">
			<data element_type="f32" offset="1304" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="28" name="3387339112103" type="Const" version="opset1">
			<data element_type="f32" offset="1308" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="29" name="3388339212274" type="Const" version="opset1">
			<data element_type="f32" offset="1304" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="30" name="3389339311296" type="Const" version="opset1">
			<data element_type="f32" offset="1308" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="31" name="3486349012544" type="Const" version="opset1">
			<data element_type="f32" offset="1312" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="32" name="3487349110939" type="Const" version="opset1">
			<data element_type="f32" offset="1316" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="33" name="3488349213390" type="Const" version="opset1">
			<data element_type="f32" offset="1312" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="34" name="3489349311941" type="Const" version="opset1">
			<data element_type="f32" offset="1316" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="35" name="3326333011971" type="Const" version="opset1">
			<data element_type="f32" offset="1320" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="36" name="3327333111308" type="Const" version="opset1">
			<data element_type="f32" offset="1324" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="37" name="3328333210864" type="Const" version="opset1">
			<data element_type="f32" offset="1320" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="38" name="3329333311743" type="Const" version="opset1">
			<data element_type="f32" offset="1324" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="39" name="data_mul_112891129334359103112091" type="Const" version="opset1">
			<data element_type="f32" offset="1328" shape="1,150,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="763634386102913171" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="5172517611572" type="Const" version="opset1">
			<data element_type="f32" offset="1928" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="42" name="5173517713444" type="Const" version="opset1">
			<data element_type="f32" offset="1932" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="43" name="5174517813264" type="Const" version="opset1">
			<data element_type="f32" offset="1928" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="44" name="5175517912268" type="Const" version="opset1">
			<data element_type="f32" offset="1932" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="45" name="1379138111938" type="Const" version="opset1">
			<data element_type="f32" offset="1936" shape="1,150,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="1986199012124" type="Const" version="opset1">
			<data element_type="f32" offset="2536" shape="150,1,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="1987199111209" type="Const" version="opset1">
			<data element_type="f32" offset="3136" shape="150,1,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="1988199211086" type="Const" version="opset1">
			<data element_type="f32" offset="2536" shape="150,1,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="1989199312136" type="Const" version="opset1">
			<data element_type="f32" offset="3136" shape="150,1,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="net/transpose_119102713210" type="Const" version="opset1">
			<data element_type="f32" offset="3736" shape="150,150,1,1,1" size="90000"/>
			<output>
				<port id="0" names="net/transpose_119:0" precision="FP32">
					<dim>150</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="net/Conv3D_53/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>150</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>150</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="net/transpose_124/perm102512652" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" names="net/transpose_124/perm:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="4652465612067" type="Const" version="opset1">
			<data element_type="f32" offset="93736" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="54" name="4653465712817" type="Const" version="opset1">
			<data element_type="f32" offset="93740" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="55" name="4654465812787" type="Const" version="opset1">
			<data element_type="f32" offset="93736" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="56" name="4655465911347" type="Const" version="opset1">
			<data element_type="f32" offset="93740" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="57" name="2386239013273" type="Const" version="opset1">
			<data element_type="f32" offset="93744" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="58" name="2387239112988" type="Const" version="opset1">
			<data element_type="f32" offset="93748" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="59" name="2388239211227" type="Const" version="opset1">
			<data element_type="f32" offset="93744" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="60" name="2389239313042" type="Const" version="opset1">
			<data element_type="f32" offset="93748" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="61" name="3186319012277" type="Const" version="opset1">
			<data element_type="f32" offset="93752" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="62" name="3187319111830" type="Const" version="opset1">
			<data element_type="f32" offset="93756" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="63" name="3188319213306" type="Const" version="opset1">
			<data element_type="f32" offset="93752" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="64" name="3189319313012" type="Const" version="opset1">
			<data element_type="f32" offset="93756" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="65" name="2966297012604" type="Const" version="opset1">
			<data element_type="f32" offset="93760" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="66" name="2967297111017" type="Const" version="opset1">
			<data element_type="f32" offset="93764" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="67" name="2968297213384" type="Const" version="opset1">
			<data element_type="f32" offset="93760" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="68" name="2969297312796" type="Const" version="opset1">
			<data element_type="f32" offset="93764" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="69" name="3416342012871" type="Const" version="opset1">
			<data element_type="f32" offset="93768" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="70" name="3417342112331" type="Const" version="opset1">
			<data element_type="f32" offset="93772" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="71" name="3418342212979" type="Const" version="opset1">
			<data element_type="f32" offset="93768" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="72" name="3419342311242" type="Const" version="opset1">
			<data element_type="f32" offset="93772" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="73" name="data_mul_112771128134245101313120" type="Const" version="opset1">
			<data element_type="f32" offset="93776" shape="1,150,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="762834113101110783" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="5152515611323" type="Const" version="opset1">
			<data element_type="f32" offset="94376" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="76" name="5153515711356" type="Const" version="opset1">
			<data element_type="f32" offset="94380" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="77" name="5154515812835" type="Const" version="opset1">
			<data element_type="f32" offset="94376" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="78" name="5155515912625" type="Const" version="opset1">
			<data element_type="f32" offset="94380" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="79" name="1375137711020" type="Const" version="opset1">
			<data element_type="f32" offset="1936" shape="1,150,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="2456246011047" type="Const" version="opset1">
			<data element_type="f32" offset="94384" shape="150,1,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="2457246113000" type="Const" version="opset1">
			<data element_type="f32" offset="94984" shape="150,1,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="2458246213414" type="Const" version="opset1">
			<data element_type="f32" offset="94384" shape="150,1,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="2459246310855" type="Const" version="opset1">
			<data element_type="f32" offset="94984" shape="150,1,1,1,1" size="600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="net/transpose_112100912946" type="Const" version="opset1">
			<data element_type="f32" offset="95584" shape="150,100,1,1,1" size="60000"/>
			<output>
				<port id="0" names="net/transpose_112:0" precision="FP32">
					<dim>150</dim>
					<dim>100</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="net/Conv3D_50/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>150</dim>
					<dim>100</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>150</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>150</dim>
					<dim>100</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="net/transpose_117/perm100712001" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" names="net/transpose_117/perm:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="4642464611584" type="Const" version="opset1">
			<data element_type="f32" offset="155584" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="88" name="4643464712346" type="Const" version="opset1">
			<data element_type="f32" offset="155588" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="89" name="4644464813147" type="Const" version="opset1">
			<data element_type="f32" offset="155584" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="90" name="4645464910807" type="Const" version="opset1">
			<data element_type="f32" offset="155588" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="91" name="3466347011281" type="Const" version="opset1">
			<data element_type="f32" offset="155592" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="92" name="3467347112637" type="Const" version="opset1">
			<data element_type="f32" offset="155596" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="93" name="3468347213324" type="Const" version="opset1">
			<data element_type="f32" offset="155592" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="94" name="3469347312115" type="Const" version="opset1">
			<data element_type="f32" offset="155596" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="95" name="2766277012283" type="Const" version="opset1">
			<data element_type="f32" offset="155600" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="96" name="2767277113195" type="Const" version="opset1">
			<data element_type="f32" offset="155604" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="97" name="2768277211752" type="Const" version="opset1">
			<data element_type="f32" offset="155600" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="98" name="2769277310954" type="Const" version="opset1">
			<data element_type="f32" offset="155604" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="99" name="2606261012442" type="Const" version="opset1">
			<data element_type="f32" offset="155608" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="100" name="2607261111590" type="Const" version="opset1">
			<data element_type="f32" offset="155612" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="101" name="2608261211407" type="Const" version="opset1">
			<data element_type="f32" offset="155608" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="102" name="2609261312931" type="Const" version="opset1">
			<data element_type="f32" offset="155612" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="103" name="data_mul_11265112693442299711404" type="Const" version="opset1">
			<data element_type="f32" offset="155616" shape="1,100,1,1,1" size="400"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>100</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="115099512064" type="Const" version="opset1">
			<data element_type="i64" offset="156016" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="11463428499213087" type="Const" version="opset1">
			<data element_type="i64" offset="156056" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="net/strided_slice_111/stack98812901" type="Const" version="opset1">
			<data element_type="i64" offset="156080" shape="5" size="40"/>
			<output>
				<port id="0" names="net/strided_slice_111/stack:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="net/strided_slice_111/stack_198912991" type="Const" version="opset1">
			<data element_type="i64" offset="156120" shape="5" size="40"/>
			<output>
				<port id="0" names="net/strided_slice_111/stack_1:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="net/strided_slice_111/stack_299010966" type="Const" version="opset1">
			<data element_type="i64" offset="156160" shape="5" size="40"/>
			<output>
				<port id="0" names="net/strided_slice_111/stack_2:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="net/Tile_8/multiples95611962" type="Const" version="opset1">
			<data element_type="i64" offset="156200" shape="5" size="40"/>
			<output>
				<port id="0" names="net/Tile_8/multiples:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="net/Tile_7/multiples89011614" type="Const" version="opset1">
			<data element_type="i64" offset="156240" shape="5" size="40"/>
			<output>
				<port id="0" names="net/Tile_7/multiples:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="net/Tile_6/multiples82413297" type="Const" version="opset1">
			<data element_type="i64" offset="156280" shape="5" size="40"/>
			<output>
				<port id="0" names="net/Tile_6/multiples:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="76203442578812385" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="5122512611863" type="Const" version="opset1">
			<data element_type="f32" offset="156320" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="114" name="5123512710801" type="Const" version="opset1">
			<data element_type="f32" offset="156324" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="115" name="5124512811833" type="Const" version="opset1">
			<data element_type="f32" offset="156320" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="116" name="5125512913528" type="Const" version="opset1">
			<data element_type="f32" offset="156324" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="117" name="1371137311134" type="Const" version="opset1">
			<data element_type="f32" offset="156328" shape="1,50,1,1,1" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="2996300011452" type="Const" version="opset1">
			<data element_type="f32" offset="156528" shape="50,1,1,1,1" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="2997300112139" type="Const" version="opset1">
			<data element_type="f32" offset="156728" shape="50,1,1,1,1" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="2998300211101" type="Const" version="opset1">
			<data element_type="f32" offset="156528" shape="50,1,1,1,1" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="2999300312967" type="Const" version="opset1">
			<data element_type="f32" offset="156728" shape="50,1,1,1,1" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="net/transpose_10578613123" type="Const" version="opset1">
			<data element_type="f32" offset="156928" shape="50,50,3,3,3" size="270000"/>
			<output>
				<port id="0" names="net/transpose_105:0" precision="FP32">
					<dim>50</dim>
					<dim>50</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="net/Conv3D_47/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>50</dim>
					<dim>50</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>50</dim>
					<dim>50</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="net/transpose_110/perm78412187" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" names="net/transpose_110/perm:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="4622462613366" type="Const" version="opset1">
			<data element_type="f32" offset="426928" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="126" name="4623462712526" type="Const" version="opset1">
			<data element_type="f32" offset="426932" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="127" name="4624462812628" type="Const" version="opset1">
			<data element_type="f32" offset="426928" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="128" name="4625462911845" type="Const" version="opset1">
			<data element_type="f32" offset="426932" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="129" name="3016302012235" type="Const" version="opset1">
			<data element_type="f32" offset="426936" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="130" name="3017302111107" type="Const" version="opset1">
			<data element_type="f32" offset="426940" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="131" name="3018302212157" type="Const" version="opset1">
			<data element_type="f32" offset="426936" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="132" name="3019302310936" type="Const" version="opset1">
			<data element_type="f32" offset="426940" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="133" name="2646265011956" type="Const" version="opset1">
			<data element_type="f32" offset="426944" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="134" name="2647265113105" type="Const" version="opset1">
			<data element_type="f32" offset="426948" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="135" name="2648265211269" type="Const" version="opset1">
			<data element_type="f32" offset="426944" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="136" name="2649265312244" type="Const" version="opset1">
			<data element_type="f32" offset="426948" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="137" name="2306231011329" type="Const" version="opset1">
			<data element_type="f32" offset="426952" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="138" name="2307231112325" type="Const" version="opset1">
			<data element_type="f32" offset="426956" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="139" name="2308231213507" type="Const" version="opset1">
			<data element_type="f32" offset="426952" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="140" name="2309231312529" type="Const" version="opset1">
			<data element_type="f32" offset="426956" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="141" name="data_mul_11169111733420077412130" type="Const" version="opset1">
			<data element_type="f32" offset="426960" shape="1,50,1,1,1" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="142" name="76123417077213234" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="4972497613339" type="Const" version="opset1">
			<data element_type="f32" offset="427160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="144" name="4973497711740" type="Const" version="opset1">
			<data element_type="f32" offset="427164" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="145" name="4974497810933" type="Const" version="opset1">
			<data element_type="f32" offset="427160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="146" name="4975497911137" type="Const" version="opset1">
			<data element_type="f32" offset="427164" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="147" name="1367136913129" type="Const" version="opset1">
			<data element_type="f32" offset="156328" shape="1,50,1,1,1" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="148" name="2126213012379" type="Const" version="opset1">
			<data element_type="f32" offset="427168" shape="50,1,1,1,1" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="149" name="2127213112757" type="Const" version="opset1">
			<data element_type="f32" offset="427368" shape="50,1,1,1,1" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="150" name="2128213211842" type="Const" version="opset1">
			<data element_type="f32" offset="427168" shape="50,1,1,1,1" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="151" name="2129213312982" type="Const" version="opset1">
			<data element_type="f32" offset="427368" shape="50,1,1,1,1" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="152" name="net/transpose_9877011371" type="Const" version="opset1">
			<data element_type="f32" offset="427568" shape="50,40,3,3,3" size="216000"/>
			<output>
				<port id="0" names="net/transpose_98:0" precision="FP32">
					<dim>50</dim>
					<dim>40</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="153" name="net/Conv3D_44/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>50</dim>
					<dim>40</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>50</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>50</dim>
					<dim>40</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="154" name="net/transpose_103/perm76812088" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" names="net/transpose_103/perm:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="155" name="4612461611521" type="Const" version="opset1">
			<data element_type="f32" offset="643568" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="156" name="4613461710960" type="Const" version="opset1">
			<data element_type="f32" offset="643572" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="157" name="4614461813039" type="Const" version="opset1">
			<data element_type="f32" offset="643568" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="158" name="4615461911692" type="Const" version="opset1">
			<data element_type="f32" offset="643572" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="159" name="2216222011539" type="Const" version="opset1">
			<data element_type="f32" offset="643576" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="160" name="2217222111491" type="Const" version="opset1">
			<data element_type="f32" offset="643580" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="161" name="2218222211710" type="Const" version="opset1">
			<data element_type="f32" offset="643576" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="162" name="2219222312997" type="Const" version="opset1">
			<data element_type="f32" offset="643580" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="163" name="3126313012028" type="Const" version="opset1">
			<data element_type="f32" offset="643584" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="164" name="3127313111737" type="Const" version="opset1">
			<data element_type="f32" offset="643588" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="165" name="3128313211263" type="Const" version="opset1">
			<data element_type="f32" offset="643584" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="166" name="3129313311449" type="Const" version="opset1">
			<data element_type="f32" offset="643588" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="167" name="2696270011257" type="Const" version="opset1">
			<data element_type="f32" offset="643592" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="168" name="2697270111872" type="Const" version="opset1">
			<data element_type="f32" offset="643596" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="169" name="2698270213285" type="Const" version="opset1">
			<data element_type="f32" offset="643592" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="170" name="2699270312880" type="Const" version="opset1">
			<data element_type="f32" offset="643596" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="171" name="data_mul_11157111613396975811035" type="Const" version="opset1">
			<data element_type="f32" offset="643600" shape="1,40,1,1,1" size="160"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="172" name="76043471975610792" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="173" name="4962496611896" type="Const" version="opset1">
			<data element_type="f32" offset="643760" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="174" name="4963496711722" type="Const" version="opset1">
			<data element_type="f32" offset="643764" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="175" name="4964496813426" type="Const" version="opset1">
			<data element_type="f32" offset="643760" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="176" name="4965496912922" type="Const" version="opset1">
			<data element_type="f32" offset="643764" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="177" name="1363136513519" type="Const" version="opset1">
			<data element_type="f32" offset="643768" shape="1,40,1,1,1" size="160"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="178" name="3296330010804" type="Const" version="opset1">
			<data element_type="f32" offset="643928" shape="40,1,1,1,1" size="160"/>
			<output>
				<port id="0" precision="FP32">
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="179" name="3297330111632" type="Const" version="opset1">
			<data element_type="f32" offset="644088" shape="40,1,1,1,1" size="160"/>
			<output>
				<port id="0" precision="FP32">
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="180" name="3298330213372" type="Const" version="opset1">
			<data element_type="f32" offset="643928" shape="40,1,1,1,1" size="160"/>
			<output>
				<port id="0" precision="FP32">
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="181" name="3299330311302" type="Const" version="opset1">
			<data element_type="f32" offset="644088" shape="40,1,1,1,1" size="160"/>
			<output>
				<port id="0" precision="FP32">
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="182" name="net/transpose_9175412145" type="Const" version="opset1">
			<data element_type="f32" offset="644248" shape="40,40,3,3,3" size="172800"/>
			<output>
				<port id="0" names="net/transpose_91:0" precision="FP32">
					<dim>40</dim>
					<dim>40</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="183" name="net/Conv3D_41/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>40</dim>
					<dim>40</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>40</dim>
					<dim>40</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="184" name="net/transpose_96/perm75211104" type="Const" version="opset1">
			<data element_type="i64" offset="16" shape="5" size="40"/>
			<output>
				<port id="0" names="net/transpose_96/perm:0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="185" name="4602460613447" type="Const" version="opset1">
